JonathandNidhog/ESP32Toy/Arduino/ESP32Toy_DoomGeneric_Phase3/esp32toy_base_system.cpp
#include "esp32toy_base_system.h"

#include <Arduino.h>
#include <Wire.h>
#include <SPI.h>
#include <Adafruit_GFX.h>
#include <Adafruit_ST7735.h>
#include <esp_heap_caps.h>
#include <math.h>
#include <string.h>

extern Adafruit_ST7735 tft;
#define osTft tft

#define OS_TFT_BL 21
#define OS_POT_PIN 1
#define OS_I2C_SDA 4
#define OS_I2C_SCL 5
#define OS_RIGHT_JOY_X_PIN 16
#define OS_RIGHT_JOY_Y_PIN 8
#define OS_RIGHT_JOY_SW_PIN 6
#define OS_KEY_A_PIN 15
#define OS_KEY_B_PIN 14
#define OS_LEFT_JOY_X_PIN 17
#define OS_LEFT_JOY_Y_PIN 18
#define OS_LEFT_JOY_SW_PIN 13

static const int kOSW = 160;
static const int kOSH = 128;
static const int kFramePixels = kOSW * kOSH;
static uint16_t *frameBuf = nullptr;

static bool osDisplayReady = false;
static bool osBootAnimPlayed = false;
static uint8_t selectedItem = 0;
static uint32_t lastNavMs = 0;
static uint32_t lastFrameMs = 0;
static uint32_t warningUntilMs = 0;

static bool aStable = false, bStable = false, leftSWStable = false;
static bool aRawPrev = false, bRawPrev = false, leftSWRawPrev = false;
static uint32_t aChangedAt = 0, bChangedAt = 0, leftSWChangedAt = 0;
static bool aPrev = false, bPrev = false, leftSWPrev = false;

static uint16_t osRGB565(uint8_t r, uint8_t g, uint8_t b) {
  return ((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3);
}

static float osClamp(float v, float lo, float hi) {
  if (v < lo) return lo;
  if (v > hi) return hi;
  return v;
}

static float osDeadzone(float v, float dz) {
  if (fabsf(v) <= dz) return 0.0f;
  const float s = v >= 0.0f ? 1.0f : -1.0f;
  return s * osClamp((fabsf(v) - dz) / (1.0f - dz), 0.0f, 1.0f);
}

static bool osDebouncedPressed(int pin, bool *rawPrev, bool *stable, uint32_t *changedAt) {
  const bool rawPressed = digitalRead(pin) == LOW;
  const uint32_t now = millis();
  if (rawPressed != *rawPrev) {
    *rawPrev = rawPressed;
    *changedAt = now;
  }
  if (now - *changedAt >= 30 && rawPressed != *stable) *stable = rawPressed;
  return *stable;
}

static void osAllocFrameBuffer() {
  if (frameBuf) return;
  frameBuf = (uint16_t*)heap_caps_malloc(kFramePixels * sizeof(uint16_t), MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
  if (!frameBuf) frameBuf = (uint16_t*)heap_caps_malloc(kFramePixels * sizeof(uint16_t), MALLOC_CAP_8BIT);
}

static void fbClear(uint16_t c) {
  if (!frameBuf) return;
  for (int i = 0; i < kFramePixels; ++i) frameBuf[i] = c;
}

static void fbPixel(int x, int y, uint16_t c) {
  if (!frameBuf) return;
  if ((unsigned)x >= kOSW || (unsigned)y >= kOSH) return;
  frameBuf[y * kOSW + x] = c;
}

static void fbRect(int x, int y, int w, int h, uint16_t c) {
  if (!frameBuf || w <= 0 || h <= 0) return;
  const int x0 = max(0, x);
  const int y0 = max(0, y);
  const int x1 = min(kOSW, x + w);
  const int y1 = min(kOSH, y + h);
  for (int yy = y0; yy < y1; ++yy) {
    uint16_t *row = frameBuf + yy * kOSW;
    for (int xx = x0; xx < x1; ++xx) row[xx] = c;
  }
}

static void fbCircle(int cx, int cy, int r, uint16_t c) {
  if (r <= 0) { fbPixel(cx, cy, c); return; }
  const int r2 = r * r;
  for (int y = -r; y <= r; ++y) {
    for (int x = -r; x <= r; ++x) if (x * x + y * y <= r2) fbPixel(cx + x, cy + y, c);
  }
}

static void fbPush() {
  if (frameBuf) osTft.drawRGBBitmap(0, 0, frameBuf, kOSW, kOSH);
}

static void osDrawCenteredDirect(int y, const char *text, uint16_t color, uint8_t size = 1) {
  osTft.setTextSize(size);
  osTft.setTextColor(color);
  const int textWidth = (int)strlen(text) * 6 * size;
  int x = (kOSW - textWidth) / 2;
  if (x < 0) x = 0;
  osTft.setCursor(x, y);
  osTft.print(text);
}

// ---------------- MPU6050 ----------------
static uint8_t mpuAddr = 0x68;
static bool mpuOk = false;
static bool mpuTriedInit = false;
static float ax = 0.0f, ay = 0.0f, az = 1.0f;
static float gx = 0.0f, gy = 0.0f, gz = 0.0f;
static float biasAX = 0.0f, biasAY = 0.0f;
static float lastAX = 0.0f, lastAY = 0.0f, lastAZ = 1.0f;

static bool osCheckI2C(uint8_t address) {
  Wire.beginTransmission(address);
  return Wire.endTransmission() == 0;
}

static bool osReadMPU() {
  if (!mpuOk) return false;
  Wire.beginTransmission(mpuAddr);
  Wire.write(0x3B);
  if (Wire.endTransmission(false) != 0) return false;
  Wire.requestFrom(mpuAddr, (uint8_t)14, (uint8_t)true);
  if (Wire.available() < 14) return false;

  const int16_t rawAX = (int16_t)((Wire.read() << 8) | Wire.read());
  const int16_t rawAY = (int16_t)((Wire.read() << 8) | Wire.read());
  const int16_t rawAZ = (int16_t)((Wire.read() << 8) | Wire.read());
  Wire.read(); Wire.read();
  const int16_t rawGX = (int16_t)((Wire.read() << 8) | Wire.read());
  const int16_t rawGY = (int16_t)((Wire.read() << 8) | Wire.read());
  const int16_t rawGZ = (int16_t)((Wire.read() << 8) | Wire.read());

  ax = rawAX / 16384.0f;
  ay = rawAY / 16384.0f;
  az = rawAZ / 16384.0f;
  gx = rawGX / 131.0f;
  gy = rawGY / 131.0f;
  gz = rawGZ / 131.0f;
  return true;
}

static void osInitMPU() {
  if (mpuTriedInit) return;
  mpuTriedInit = true;
  Wire.setPins(OS_I2C_SDA, OS_I2C_SCL);
  Wire.begin();
  delay(60);

  if (osCheckI2C(0x68)) { mpuAddr = 0x68; mpuOk = true; }
  else if (osCheckI2C(0x69)) { mpuAddr = 0x69; mpuOk = true; }
  else { mpuOk = false; return; }

  const uint8_t initRegs[][2] = { {0x6B, 0x00}, {0x1A, 0x03}, {0x1C, 0x00}, {0x1B, 0x00} };
  for (uint8_t i = 0; i < 4; ++i) {
    Wire.beginTransmission(mpuAddr);
    Wire.write(initRegs[i][0]);
    Wire.write(initRegs[i][1]);
    Wire.endTransmission(true);
  }

  float sumAX = 0.0f, sumAY = 0.0f;
  int valid = 0;
  for (int i = 0; i < 80; ++i) {
    if (osReadMPU()) { sumAX += ax; sumAY += ay; valid++; }
    delay(4);
  }
  if (valid > 0) { biasAX = sumAX / valid; biasAY = sumAY / valid; }
  lastAX = ax; lastAY = ay; lastAZ = az;
}

static void mapBaseVectorToScreen(float baseX, float baseY, float *outX, float *outY) {
  *outX = -baseY;
  *outY = baseX;
}

static void osEnsureHardware() {
  if (osDisplayReady) return;
  pinMode(OS_TFT_BL, OUTPUT);
  digitalWrite(OS_TFT_BL, HIGH);
  pinMode(OS_POT_PIN, INPUT);
  pinMode(OS_RIGHT_JOY_X_PIN, INPUT);
  pinMode(OS_RIGHT_JOY_Y_PIN, INPUT);
  pinMode(OS_LEFT_JOY_X_PIN, INPUT);
  pinMode(OS_LEFT_JOY_Y_PIN, INPUT);
  pinMode(OS_RIGHT_JOY_SW_PIN, INPUT_PULLUP);
  pinMode(OS_LEFT_JOY_SW_PIN, INPUT_PULLUP);
  pinMode(OS_KEY_A_PIN, INPUT_PULLUP);
  pinMode(OS_KEY_B_PIN, INPUT_PULLUP);
  osAllocFrameBuffer();
  osInitMPU();
  osDisplayReady = true;
}

static void osReadButtons(bool *aDown, bool *bDown, bool *leftSWDown) {
  *aDown = osDebouncedPressed(OS_KEY_A_PIN, &aRawPrev, &aStable, &aChangedAt);
  *bDown = osDebouncedPressed(OS_KEY_B_PIN, &bRawPrev, &bStable, &bChangedAt);
  *leftSWDown = osDebouncedPressed(OS_LEFT_JOY_SW_PIN, &leftSWRawPrev, &leftSWStable, &leftSWChangedAt);
}

static void osDrawAppRow(int y, const char *label, bool selected, bool enabled) {
  const uint16_t bg = selected ? osRGB565(90, 18, 12) : osRGB565(16, 14, 14);
  const uint16_t border = selected ? osRGB565(220, 55, 30) : osRGB565(50, 45, 45);
  const uint16_t fg = enabled ? ST77XX_WHITE : osRGB565(105, 105, 105);
  osTft.fillRoundRect(14, y, 132, 24, 5, bg);
  osTft.drawRoundRect(14, y, 132, 24, 5, border);
  osTft.setTextSize(1);
  osTft.setTextColor(fg);
  osTft.setCursor(28, y + 8);
  osTft.print(label);
  if (!enabled) { osTft.setCursor(104, y + 8); osTft.print("MISS"); }
}

