JonathandNidhog/ESP32Toy/Arduino/ESP32Toy_DoomGeneric_Phase3/esp32toy_base_system.cpp
static void osBootAnimation(bool doomReady) {
  if (osBootAnimPlayed) return;
  osBootAnimPlayed = true;
  for (int f = 0; f < 24; ++f) {
    const uint8_t glow = (uint8_t)(18 + f * 6);
    osTft.fillScreen(osRGB565(1, 4, 12));
    osTft.drawRoundRect(12, 20, 136, 82, 8, osRGB565(glow, glow + 24, 255));
    osDrawCenteredDirect(34, "ESP32Toy", ST77XX_WHITE, 2);
    osDrawCenteredDirect(58, doomReady ? "DOOM READY" : "WATER READY", doomReady ? ST77XX_GREEN : ST77XX_CYAN, 1);
    osTft.fillRect(28, 86, (f * 104) / 23, 4, osRGB565(55, 210, 255));
    delay(16);
  }
}

void ESP32Toy_OSRedrawLauncher(bool doomReady) {
  osEnsureHardware();
  osTft.fillScreen(ST77XX_BLACK);
  osTft.fillRect(0, 0, kOSW, 20, osRGB565(95, 12, 8));
  osDrawCenteredDirect(5, "ESP32Toy OS", ST77XX_WHITE, 1);
  osTft.setTextSize(1);
  osTft.setTextColor(osRGB565(170, 170, 170));
  osTft.setCursor(12, 28);
  osTft.print(mpuOk ? "Select app   GYRO" : "Select app   NO GYRO");
  osDrawAppRow(44, "Water Lab", selectedItem == 0, true);
  osDrawAppRow(74, "DOOM", selectedItem == 1, doomReady);
  osTft.setTextColor(osRGB565(150, 150, 150));
  osTft.setCursor(10, 112);
  osTft.print("A:OK  B:Back  Stick:Move");
  if (millis() < warningUntilMs) {
    osTft.fillRect(12, 98, 136, 11, ST77XX_BLACK);
    osDrawCenteredDirect(99, "doom1.wad not ready", ST77XX_YELLOW, 1);
  }
}

void ESP32Toy_OSInitLauncher(bool doomReady) {
  osEnsureHardware();
  osBootAnimation(doomReady);
  selectedItem = 0;
  lastNavMs = 0;
  warningUntilMs = 0;
  ESP32Toy_OSRedrawLauncher(doomReady);
}

ESP32Toy_OSAction ESP32Toy_OSLauncherTick(bool doomReady) {
  osEnsureHardware();
  bool aDown = false, bDown = false, leftSWDown = false;
  osReadButtons(&aDown, &bDown, &leftSWDown);
  const bool aPressed = aDown && !aPrev;
  aPrev = aDown;

  const int rawY = analogRead(OS_LEFT_JOY_Y_PIN);
  const float y = osDeadzone(osClamp((rawY - 2048) / 1800.0f, -1.0f, 1.0f) * -1.0f, 0.14f);
  const uint32_t now = millis();
  if (now - lastNavMs > 180) {
    if (y > 0.45f && selectedItem > 0) { selectedItem--; lastNavMs = now; ESP32Toy_OSRedrawLauncher(doomReady); }
    else if (y < -0.45f && selectedItem < 1) { selectedItem++; lastNavMs = now; ESP32Toy_OSRedrawLauncher(doomReady); }
  }

  if (warningUntilMs && now > warningUntilMs) { warningUntilMs = 0; ESP32Toy_OSRedrawLauncher(doomReady); }

  if (aPressed || (leftSWDown && !leftSWPrev)) {
    leftSWPrev = leftSWDown;
    if (selectedItem == 0) return ESP32TOY_OS_ACTION_START_WATER;
    if (doomReady) return ESP32TOY_OS_ACTION_START_DOOM;
    warningUntilMs = now + 1200;
    ESP32Toy_OSRedrawLauncher(doomReady);
  }
  leftSWPrev = leftSWDown;
  (void)bDown;
  return ESP32TOY_OS_ACTION_NONE;
}

// ---------------- Fullscreen metaball liquid ----------------
static const int WATER_COUNT_MIN = 48;
static const int WATER_COUNT_MAX = 120;
static int activeWaterCount = 88;
static const float WATER_RADIUS = 4.0f;
static float wx[WATER_COUNT_MAX], wy[WATER_COUNT_MAX], wvx[WATER_COUNT_MAX], wvy[WATER_COUNT_MAX];

static const int DROP_COUNT_MAX = 18;
static bool dropActive[DROP_COUNT_MAX];
static float dropX[DROP_COUNT_MAX], dropY[DROP_COUNT_MAX], dropVX[DROP_COUNT_MAX], dropVY[DROP_COUNT_MAX], dropRadius[DROP_COUNT_MAX];
static int dropLife[DROP_COUNT_MAX];
static int splashCooldown = 0;

static const int GRID_STEP = 2;
static const int FIELD_W = kOSW / GRID_STEP + 3;
static const int FIELD_H = kOSH / GRID_STEP + 3;
static uint16_t densityField[FIELD_W * FIELD_H];
static const int KERNEL_R_MIN = 8;
static const int KERNEL_R_MAX = 12;
static const int KERNEL_MAX_SIZE = KERNEL_R_MAX * 2 + 1;
static int kernelR = 10;
static int kernelBuiltR = -1;
static uint16_t kernel[KERNEL_MAX_SIZE * KERNEL_MAX_SIZE];
static const uint16_t FIELD_THRESHOLD = 430;
static const uint16_t FOAM_THRESHOLD = 1750;

static float forceX = 0.0f, forceY = 0.0f;
static float joystickForceX = 0.0f, joystickForceY = 0.0f;
static float potFiltered = 0.0f;
static uint32_t waterFrame = 0;

static const uint16_t C_BG_WATER = 0x0005;
static const uint16_t C_WATER_DARK = 0x01B1;
static const uint16_t C_WATER_MID = 0x049F;
static const uint16_t C_WATER_BRIGHT = 0x2DFF;
static const uint16_t C_WATER_FOAM = 0xAFFF;
static const uint16_t C_EDGE = 0xB73F;
static const uint16_t C_WHITE = 0xFFFF;

static uint16_t waterDensityColor(uint16_t d, int gy) {
  const int shimmer = (int)((waterFrame + gy * 3) & 15);
  if (d > FOAM_THRESHOLD) return shimmer < 4 ? C_WATER_FOAM : C_WATER_BRIGHT;
  if (d > 1000) return shimmer < 3 ? C_WATER_BRIGHT : C_WATER_MID;
  return shimmer < 2 ? C_WATER_MID : C_WATER_DARK;
}

static void waterBuildKernel() {
  memset(kernel, 0, sizeof(kernel));
  const float radiusPx = kernelR * GRID_STEP;
  const float radiusSq = radiusPx * radiusPx;
  const int kernelSize = kernelR * 2 + 1;
  for (int ky = -kernelR; ky <= kernelR; ++ky) {
    for (int kx = -kernelR; kx <= kernelR; ++kx) {
      const float px = kx * GRID_STEP;
      const float py = ky * GRID_STEP;
      const float d2 = px * px + py * py;
      if (d2 < radiusSq) {
        const float t = 1.0f - d2 / radiusSq;
        kernel[(ky + kernelR) * kernelSize + (kx + kernelR)] = (uint16_t)(t * t * 1240.0f);
      }
    }
  }
  kernelBuiltR = kernelR;
}

static void waterReset() {
  randomSeed(micros());
  if (kernelBuiltR != kernelR) waterBuildKernel();
  const int cols = 13;
  const int rows = (WATER_COUNT_MAX + cols - 1) / cols;
  const float spacingX = 10.2f;
  const float spacingY = 6.2f;
  const float startX = (kOSW - (cols - 1) * spacingX) * 0.5f;
  const float startY = kOSH - (rows - 1) * spacingY - 7.0f;
  int id = 0;
  for (int y = 0; y < rows; ++y) {
    for (int x = 0; x < cols; ++x) {
      if (id >= WATER_COUNT_MAX) break;
      wx[id] = startX + x * spacingX + random(-1, 2);
      wy[id] = startY + y * spacingY + random(-1, 2);
      wvx[id] = 0.0f;
      wvy[id] = 0.0f;
      id++;
    }
  }
  for (int i = 0; i < DROP_COUNT_MAX; ++i) { dropActive[i] = false; dropLife[i] = 0; }
  forceX = forceY = joystickForceX = joystickForceY = 0.0f;
  splashCooldown = 0;
  waterFrame = 0;
  activeWaterCount = 88;
  if (mpuOk) { lastAX = ax; lastAY = ay; lastAZ = az; }
}

static void waterUpdateAmount() {
  const int potRaw = analogRead(OS_POT_PIN);
  potFiltered = potFiltered <= 0.1f ? potRaw : potFiltered * 0.90f + potRaw * 0.10f;
  const float t = osClamp(potFiltered / 4095.0f, 0.0f, 1.0f);
  int targetWaterCount = constrain(WATER_COUNT_MIN + (int)(t * (WATER_COUNT_MAX - WATER_COUNT_MIN)), WATER_COUNT_MIN, WATER_COUNT_MAX);
  int targetKernelR = constrain(KERNEL_R_MIN + (int)(t * (KERNEL_R_MAX - KERNEL_R_MIN) + 0.5f), KERNEL_R_MIN, KERNEL_R_MAX);
  if (targetWaterCount > activeWaterCount) {
    for (int i = activeWaterCount; i < targetWaterCount; ++i) {
      const int ref = random(0, activeWaterCount > 0 ? activeWaterCount : 1);
      wx[i] = osClamp(wx[ref] + random(-8, 9), WATER_RADIUS, kOSW - 1 - WATER_RADIUS);
      wy[i] = osClamp(wy[ref] + random(-8, 9), WATER_RADIUS, kOSH - 1 - WATER_RADIUS);
      wvx[i] = wvx[ref] * 0.15f;
      wvy[i] = wvy[ref] * 0.15f;
    }
  }
  activeWaterCount = targetWaterCount;
  kernelR = targetKernelR;
  if (kernelR != kernelBuiltR) waterBuildKernel();
}

