JonathandNidhog/ESP32Toy/Arduino/ESP32Toy_DoomGeneric_Phase3/esp32toy_base_system.cpp
static void waterConstrainParticle(int i) {
  const float bounce = -0.20f;
  if (wx[i] < WATER_RADIUS) { wx[i] = WATER_RADIUS; wvx[i] *= bounce; }
  if (wx[i] > kOSW - 1 - WATER_RADIUS) { wx[i] = kOSW - 1 - WATER_RADIUS; wvx[i] *= bounce; }
  if (wy[i] < WATER_RADIUS) { wy[i] = WATER_RADIUS; wvy[i] *= bounce; }
  if (wy[i] > kOSH - 1 - WATER_RADIUS) { wy[i] = kOSH - 1 - WATER_RADIUS; wvy[i] *= bounce; }
}

static void waterSolvePairs() {
  const float targetDist = WATER_RADIUS * 1.50f;
  const float targetDistSq = targetDist * targetDist;
  for (int i = 0; i < activeWaterCount; ++i) {
    for (int j = i + 1; j < activeWaterCount; ++j) {
      const float dx = wx[j] - wx[i];
      const float dy = wy[j] - wy[i];
      const float d2 = dx * dx + dy * dy;
      if (d2 < 0.0001f || d2 >= targetDistSq) continue;
      const float dist = sqrtf(d2);
      const float push = (targetDist - dist) * 0.47f;
      const float nx = dx / dist;
      const float ny = dy / dist;
      wx[i] -= nx * push; wy[i] -= ny * push;
      wx[j] += nx * push; wy[j] += ny * push;
    }
  }
}

static void waterApplyViscosity() {
  const float rangeSq = WATER_RADIUS * WATER_RADIUS * 7.0f;
  for (int i = 0; i < activeWaterCount; ++i) {
    for (int j = i + 1; j < activeWaterCount; ++j) {
      const float dx = wx[j] - wx[i];
      const float dy = wy[j] - wy[i];
      if (dx * dx + dy * dy >= rangeSq) continue;
      const float dvx = wvx[j] - wvx[i];
      const float dvy = wvy[j] - wvy[i];
      const float blend = 0.024f;
      wvx[i] += dvx * blend; wvy[i] += dvy * blend;
      wvx[j] -= dvx * blend; wvy[j] -= dvy * blend;
    }
  }
}

static void waterSpawnDrop(float x, float y, float vx, float vy, float radius) {
  for (int i = 0; i < DROP_COUNT_MAX; ++i) {
    if (!dropActive[i]) {
      dropActive[i] = true;
      dropX[i] = x; dropY[i] = y; dropVX[i] = vx; dropVY[i] = vy; dropRadius[i] = radius; dropLife[i] = 74;
      return;
    }
  }
}

static void waterEmitSplash(float fx, float fy, float strength) {
  if (activeWaterCount <= 0) return;
  float len = sqrtf(fx * fx + fy * fy);
  float upX = 0.0f, upY = -1.0f;
  if (len > 0.05f) { upX = -fx / len; upY = -fy / len; }

  int ids[WATER_COUNT_MAX];
  float scores[WATER_COUNT_MAX];
  for (int i = 0; i < activeWaterCount; ++i) { ids[i] = i; scores[i] = wx[i] * upX + wy[i] * upY; }
  const int pick = min(10, activeWaterCount);
  for (int a = 0; a < pick; ++a) {
    int best = a;
    for (int b = a + 1; b < activeWaterCount; ++b) if (scores[b] > scores[best]) best = b;
    float ts = scores[a]; scores[a] = scores[best]; scores[best] = ts;
    int ti = ids[a]; ids[a] = ids[best]; ids[best] = ti;
  }

  const int count = constrain((int)(strength * 1.55f), 4, 8);
  for (int n = 0; n < count; ++n) {
    const int id = ids[random(0, pick)];
    const float side = random(-100, 101) / 100.0f;
    const float sideX = -upY, sideY = upX;
    const float launch = 0.92f + strength * 0.44f;
    const float spread = 0.52f + strength * 0.12f;
    waterSpawnDrop(wx[id], wy[id], wvx[id] + upX * launch + sideX * side * spread,
                   wvy[id] + upY * launch + sideY * side * spread, random(1, 3));
    wvx[id] += upX * 0.16f;
    wvy[id] += upY * 0.16f;
  }
}

static void waterUpdateDrops() {
  for (int i = 0; i < DROP_COUNT_MAX; ++i) {
    if (!dropActive[i]) continue;
    dropVX[i] += forceX * 0.012f;
    dropVY[i] += 0.072f + forceY * 0.012f;
    dropVX[i] *= 0.994f; dropVY[i] *= 0.994f;
    dropX[i] += dropVX[i]; dropY[i] += dropVY[i]; dropLife[i]--;
    if (dropX[i] < 2) { dropX[i] = 2; dropVX[i] *= -0.24f; }
    if (dropX[i] > kOSW - 3) { dropX[i] = kOSW - 3; dropVX[i] *= -0.24f; }
    if (dropY[i] < 2) { dropY[i] = 2; dropVY[i] *= -0.20f; }
    for (int j = 0; j < activeWaterCount; ++j) {
      const float dx = dropX[i] - wx[j], dy = dropY[i] - wy[j];
      if (dx * dx + dy * dy < WATER_RADIUS * WATER_RADIUS * 1.85f) {
        wvx[j] += dropVX[i] * 0.045f; wvy[j] += dropVY[i] * 0.045f; dropActive[i] = false; break;
      }
    }
    if (dropY[i] > kOSH || dropLife[i] <= 0) dropActive[i] = false;
  }
}

static void waterBuildDensityField() {
  memset(densityField, 0, sizeof(densityField));
  const int kernelSize = kernelR * 2 + 1;
  for (int i = 0; i < activeWaterCount; ++i) {
    const int centerX = (int)(wx[i] / GRID_STEP);
    const int centerY = (int)(wy[i] / GRID_STEP);
    for (int ky = -kernelR; ky <= kernelR; ++ky) {
      const int fy = centerY + ky;
      if (fy < 0 || fy >= FIELD_H) continue;
      for (int kx = -kernelR; kx <= kernelR; ++kx) {
        const int fx = centerX + kx;
        if (fx < 0 || fx >= FIELD_W) continue;
        const uint16_t add = kernel[(ky + kernelR) * kernelSize + (kx + kernelR)];
        if (!add) continue;
        const int idx = fy * FIELD_W + fx;
        const uint32_t v = densityField[idx] + add;
        densityField[idx] = v > 65535 ? 65535 : v;
      }
    }
  }
}

static void waterDrawBody() {
  fbClear(C_BG_WATER);
  waterBuildDensityField();

  for (int gy = 0; gy < FIELD_H; ++gy) {
    int runStart = -1;
    uint16_t runColor = C_WATER_DARK;
    for (int gx = 0; gx < FIELD_W; ++gx) {
      const uint16_t d = densityField[gy * FIELD_W + gx];
      const bool inside = d >= FIELD_THRESHOLD;
      if (inside && runStart < 0) { runStart = gx; runColor = waterDensityColor(d, gy); }
      const bool last = gx == FIELD_W - 1;
      if ((!inside || last) && runStart >= 0) {
        const int runEnd = (inside && last) ? gx : gx - 1;
        fbRect(runStart * GRID_STEP, gy * GRID_STEP, (runEnd - runStart + 1) * GRID_STEP, GRID_STEP, runColor);
        runStart = -1;
      }
    }
  }

  for (int gy = 1; gy < FIELD_H - 1; ++gy) {
    for (int gx = 1; gx < FIELD_W - 1; ++gx) {
      const int idx = gy * FIELD_W + gx;
      if (densityField[idx] < FIELD_THRESHOLD) continue;
      const bool topEdge = densityField[idx - FIELD_W] < FIELD_THRESHOLD;
      const bool sideEdge = densityField[idx - 1] < FIELD_THRESHOLD || densityField[idx + 1] < FIELD_THRESHOLD;
      if (topEdge) {
        fbRect(gx * GRID_STEP, gy * GRID_STEP, GRID_STEP, 1, C_EDGE);
        if (((gx * 3 + gy + waterFrame) & 15) < 2) fbPixel(gx * GRID_STEP, gy * GRID_STEP, C_WHITE);
      } else if (sideEdge && ((gy + waterFrame) & 7) == 0) {
        fbPixel(gx * GRID_STEP, gy * GRID_STEP, C_WATER_BRIGHT);
      }
      if (densityField[idx] > FOAM_THRESHOLD && ((gx + gy + waterFrame) & 11) == 0) {
        fbPixel(gx * GRID_STEP + 1, gy * GRID_STEP, C_WATER_FOAM);
      }
    }
  }

