JonathandNidhog/ESP32Toy/Arduino/ESP32Toy_DoomGeneric_Phase3/esp32toy_base_system.cpp
  for (int i = 0; i < DROP_COUNT_MAX; ++i) {
    if (!dropActive[i]) continue;
    fbCircle((int)dropX[i], (int)dropY[i], (int)dropRadius[i], C_EDGE);
    if (dropRadius[i] >= 2) fbPixel((int)dropX[i] - 1, (int)dropY[i] - 1, C_WHITE);
  }
  fbPush();
}

static void waterReadJoystickForce(float *outX, float *outY) {
  const int rawX = analogRead(OS_LEFT_JOY_X_PIN);
  const int rawY = analogRead(OS_LEFT_JOY_Y_PIN);
  float joyX = osClamp((rawX - 2048) / 1800.0f, -1.0f, 1.0f);
  float joyY = osClamp((rawY - 2048) / 1800.0f, -1.0f, 1.0f) * -1.0f;
  *outX = osDeadzone(joyX, 0.14f);
  *outY = osDeadzone(joyY, 0.14f);
}

static void waterStep(bool aDown, bool leftSWDown) {
  waterUpdateAmount();

  float joyX = 0.0f, joyY = 0.0f;
  waterReadJoystickForce(&joyX, &joyY);
  joystickForceX = joystickForceX * 0.80f + joyX * 0.20f;
  joystickForceY = joystickForceY * 0.80f + joyY * 0.20f;

  bool gotMPU = osReadMPU();
  float tiltX = 0.0f, tiltY = 0.0f, gyroScreenX = 0.0f, gyroScreenY = 0.0f;
  float splashStrength = 0.0f;

  if (gotMPU) {
    float baseTiltX = 1.0f * (ax - biasAX);
    float baseTiltY = -1.0f * (ay - biasAY);
    if (fabsf(baseTiltX) < 0.03f) baseTiltX = 0.0f;
    if (fabsf(baseTiltY) < 0.03f) baseTiltY = 0.0f;
    mapBaseVectorToScreen(osClamp(baseTiltX * 2.10f, -1.0f, 1.0f), osClamp(baseTiltY * 2.10f, -1.0f, 1.0f), &tiltX, &tiltY);
    mapBaseVectorToScreen(osClamp(gx * 0.008f, -1.3f, 1.3f), osClamp(gy * 0.008f, -1.3f, 1.3f), &gyroScreenX, &gyroScreenY);
    const float jerk = fabsf(ax - lastAX) + fabsf(ay - lastAY) + fabsf(az - lastAZ);
    lastAX = ax; lastAY = ay; lastAZ = az;
    const float kick = fabsf(gx) * 0.0028f + fabsf(gy) * 0.0028f + fabsf(gz) * 0.0018f;
    splashStrength = jerk * 6.5f + kick;
  }

  const float targetX = tiltX + joystickForceX * 0.75f;
  const float targetY = tiltY + joystickForceY * 0.75f;
  forceX = forceX * 0.84f + osClamp(targetX, -1.35f, 1.35f) * 0.16f;
  forceY = forceY * 0.84f + osClamp(targetY, -1.35f, 1.35f) * 0.16f;

  for (int i = 0; i < activeWaterCount; ++i) {
    wvx[i] += forceX * 0.27f + gyroScreenX * 0.18f;
    wvy[i] += forceY * 0.27f + gyroScreenY * 0.18f + 0.012f;
    wvx[i] *= 0.986f; wvy[i] *= 0.986f;
    wvx[i] = osClamp(wvx[i], -4.2f, 4.2f);
    wvy[i] = osClamp(wvy[i], -4.2f, 4.2f);
    wx[i] += wvx[i]; wy[i] += wvy[i];
    waterConstrainParticle(i);
  }

  waterSolvePairs(); waterSolvePairs(); waterSolvePairs();
  for (int i = 0; i < activeWaterCount; ++i) waterConstrainParticle(i);
  waterApplyViscosity();
  waterUpdateDrops();

  if (splashCooldown > 0) splashCooldown--;
  if (splashStrength > 1.25f && splashCooldown <= 0) {
    waterEmitSplash(forceX + gyroScreenX * 0.35f, forceY + gyroScreenY * 0.35f, splashStrength);
    splashCooldown = 9;
  }
  if ((aDown || leftSWDown) && splashCooldown <= 0) {
    waterEmitSplash(forceX, forceY, 2.0f);
    splashCooldown = 8;
  }
}

bool ESP32Toy_OSWaterTick(void) {
  osEnsureHardware();
  static bool waterInitialized = false;
  if (!waterInitialized) {
    waterReset();
    fbClear(C_BG_WATER);
    fbPush();
    waterInitialized = true;
    lastFrameMs = 0;
  }

  bool aDown = false, bDown = false, leftSWDown = false;
  osReadButtons(&aDown, &bDown, &leftSWDown);
  const bool bPressed = bDown && !bPrev;
  bPrev = bDown;
  if (bPressed) { waterInitialized = false; return true; }

  const uint32_t now = millis();
  if (now - lastFrameMs < 32) return false;
  lastFrameMs = now;
  waterFrame++;
  waterStep(aDown, leftSWDown);
  waterDrawBody();
  return false;
}
